In [8]:
n1 = [2, 4, 6, 8, 10, 12, 15]
n1

[2, 4, 6, 8, 10, 12, 15]

In [9]:
n2 = [n+1 for n in n1]
n2

[3, 5, 7, 9, 11, 13, 16]

In [12]:
#create a list comprehension that will make all values in n2 greater than the mean into 1s and the rest onto 0s
n3 = [1 if n > sum(n2)/len(n2) else 0 for n in n2]
n3

[0, 0, 0, 0, 1, 1, 1]

In [33]:
numbers = [1, 5, 2, 0, 8, 9, 1, 0, 0, -3]
#create a list comprehension that will make all the 1s 0s and all the 0s 1s
flipped = [1 if x==0 else 0 if x==1 else x for x in numbers]
flipped

[0, 5, 2, 1, 8, 9, 0, 1, 1, -3]

In [41]:
[[x**2, x**.5] for x in [y for y in numbers if y >= 0]]

[[1, 1.0],
 [25, 2.23606797749979],
 [4, 1.4142135623730951],
 [0, 0.0],
 [64, 2.8284271247461903],
 [81, 3.0],
 [1, 1.0],
 [0, 0.0],
 [0, 0.0]]

In [43]:
[[x**2, x**.5] for x in numbers if x >= 0]

[[1, 1.0],
 [25, 2.23606797749979],
 [4, 1.4142135623730951],
 [0, 0.0],
 [64, 2.8284271247461903],
 [81, 3.0],
 [1, 1.0],
 [0, 0.0],
 [0, 0.0]]

In [55]:
cols = ['name', 'age', 'salary']
values = [['marat', 'chris', 'craig', 'akber', 'muhammad', 'alexander'], [26, 29, 30, 38, 25, 24], [55000, 42000, 90000, 80000, 50000, 20000]]
new_dict = {cols[i]:values[i] for i in range(len(cols))}
new_dict

{'age': [26, 29, 30, 38, 25, 24],
 'name': ['marat', 'chris', 'craig', 'akber', 'muhammad', 'alexander'],
 'salary': [55000, 42000, 90000, 80000, 50000, 20000]}

In [52]:
new_dict_2 = {x:y for x, y in zip(cols, values)}

In [53]:
import pandas as pd
new_df = pd.DataFrame(new_dict)
new_df

   age       name  salary
0   26      marat   55000
1   29      chris   42000
2   30      craig   90000
3   38      akber   80000
4   25   muhammad   50000
5   24  alexander   20000

In [54]:
new_df2 = pd.DataFrame(new_dict_2)
new_df2

   age       name  salary
0   26      marat   55000
1   29      chris   42000
2   30      craig   90000
3   38      akber   80000
4   25   muhammad   50000
5   24  alexander   20000